app/views/states/_form.html.erb

SELECT "countries".* FROM "countries" ORDER BY "countries"."name" ASC
---
				<div class="col-sm-10">
					<%= f.collection_select :country_id, Country.order(:name), :id, :name, {prompt: "Seleccione el país"},  class: "form-control"  %>