app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
  def index
    @search = Category.ransack(params[:q])
    @categories = @search.result.page(params[:page]).per(20).order(:name)