app/controllers/cities_controller.rb

INSERT INTO "cities" ("name", "state_id", "country_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "San Cristóbal"], ["state_id", 1], ["country_id", 1], ["created_at", 2016-09-22 23:32:31 UTC], ["updated_at", 2016-09-22 23:32:31 UTC]]
---
	def create
		@city = City.new(city_params)

		if @city.save

SELECT "cities".* FROM "cities" ORDER BY "cities"."name" ASC
SELECT "states".* FROM "states" ORDER BY "states"."name" ASC
---
	def find_cities_given_state_id
	   state_id = params[:state_id]#utilizes the url to extract state_id ".../find_cities_given_state_id?state_id=1"
	   cities = City.search_for_state_id(state_id).order(:name).as_json#query the model for the data and convert it to a hash using as_json

UPDATE "cities" SET "state_id" = $1, "updated_at" = $2 WHERE "cities"."id" = $3  [["state_id", 1], ["updated_at", 2016-09-21 14:46:05 UTC], ["id", 1]]
---
	def update
		if @city.update(city_params)