app/controllers/countries_controller.rb

 	def create
 		@country = Country.new(country_params)

 		if @country.save
---
INSERT INTO "countries" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Venezuela"], ["created_at", 2016-09-21 19:27:58 UTC], ["updated_at", 2016-09-21 19:27:58 UTC]]

 	def index
		@search = Country.ransack(params[:q])
		@countries = @search.result.page(params[:page]).per(20).order(:name)
---
SELECT "countries".* FROM "countries" ORDER BY "countries"."name" ASC

 	def set_country
		@country = Country.find(params[:id])
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

 	def update
 		if @country.update(country_params)
---
UPDATE "countries" SET "name" = $1, "updated_at" = $2 WHERE "countries"."id" = $3  [["name", "Mexico"], ["updated_at", 2016-09-21 19:51:19 UTC], ["id", 2]]