app/controllers/states_controller.rb

INSERT INTO "states" ("name", "country_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Táchira"], ["country_id", 1], ["created_at", 2016-09-21 20:07:20 UTC], ["updated_at", 2016-09-21 20:07:20 UTC]]
---
 	def create
 		@state = State.new(state_params)

 		if @state.save

SELECT "countries".* FROM "countries" ORDER BY "countries"."name" ASC
SELECT "states".* FROM "states" ORDER BY "states"."name" ASC
---
 	def find_states_given_country_id
	   country_id = params[:country_id]#utilizes the url to extract country_id ".../find_states_given_country_id?country_id=1"
	   states = State.search_for_country_id(country_id).order(:name).as_json#query the model for the data and convert it to a hash using as_json

SELECT  "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def set_state
		@state = State.find(params[:id])

UPDATE "states" SET "name" = $1, "updated_at" = $2 WHERE "states"."id" = $3  [["name", "Táchiraa"], ["updated_at", 2016-09-18 21:37:37 UTC], ["id", 1]]
---
	def update
		if @state.update(state_params)