app/views/cities/_form.html.erb

				<div class="col-sm-10">
  <%= f.collection_select :country_id, Country.order(:name), :id, :name, :prompt => "Select a Country" %>
---
SELECT "countries".* FROM "countries" ORDER BY "countries"."name" ASC

				<div class="col-sm-10">
<%= f.collection_select :state_id, State.order(:name), :id, :name, :prompt => "Select a State" %>
---
SELECT "states".* FROM "states" ORDER BY "states"."name" ASC