app/views/cities/index.html.erb

SELECT  "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
				<td><%=city.state.name %></td>
				<% @armar =  '/assets/flags/'+ city.state.country.name %>