app/views/cities/show.html.erb

	<strong>País:</strong>
		<%= @city.state.country.name%>
---
SELECT  "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]